In [3]:
import pandas as pd
import numpy as np

In [16]:
df1 = pd.read_csv("josaa_round1_iit_results.csv")
df2 = pd.read_csv("josaa_round2_iit_results.csv")
df3 = pd.read_csv("josaa_round3_iit_results.csv")
df4 = pd.read_csv("josaa_round4_iit_results.csv")
df5 = pd.read_csv("josaa_round5_iit_results.csv")

In [13]:
df1.head()

,Institute,Academic Program,Quota,Seat Type,Gender,Opening Rank,Closing Rank
0,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",AI,OPEN,Gender-Neutral,10063,13957
1,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",AI,OPEN,Female-only (including Supernumerary),19820,22403
2,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",AI,EWS,Gender-Neutral,1912,2069
3,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",AI,EWS,Female-only (including Supernumerary),3450,3646
4,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",AI,OBC-NCL,Gender-Neutral,4402,4996

In [4]:
df.columns

Index(['Institute', 'Academic Program', 'Quota', 'Seat Type', 'Gender',
       'Opening Rank', 'Closing Rank'],
      dtype='object')

In [17]:
df1 = df1.drop('Quota',axis=1)
df2 = df2.drop('Quota',axis=1)
df3 = df3.drop('Quota',axis=1)
df4 = df4.drop('Quota',axis=1)
df5 = df5.drop('Quota',axis=1)

In [22]:
df1['round_number'] = 1
df2['round_number'] = 2
df3['round_number'] = 3
df4['round_number'] = 4
df5['round_number'] = 5

In [23]:
df1.head()

,Institute,Academic Program,Seat Type,Gender,Opening Rank,Closing Rank,round_number
0,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Gender-Neutral,10063,13957,1
1,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Female-only (including Supernumerary),19820,22403,1
2,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Gender-Neutral,1912,2069,1
3,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Female-only (including Supernumerary),3450,3646,1
4,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,Gender-Neutral,4402,4996,1

In [24]:
merged_df = pd.concat([df1, df2, df3, df4, df5], ignore_index=True)

In [25]:
merged_df.head()

,Institute,Academic Program,Seat Type,Gender,Opening Rank,Closing Rank,round_number
0,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Gender-Neutral,10063,13957,1
1,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Female-only (including Supernumerary),19820,22403,1
2,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Gender-Neutral,1912,2069,1
3,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Female-only (including Supernumerary),3450,3646,1
4,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,Gender-Neutral,4402,4996,1

In [28]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15622 entries, 0 to 15621
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Institute         15622 non-null  object
 1   Academic Program  15622 non-null  object
 2   Seat Type         15622 non-null  object
 3   Gender            15622 non-null  object
 4   Opening Rank      15622 non-null  object
 5   Closing Rank      15622 non-null  object
 6   round_number      15622 non-null  int64
dtypes: int64(1), object(6)
memory usage: 854.5+ KB

In [29]:
merged_df.to_csv('cutoff_data.csv', index=False)

In [30]:
df = pd.read_csv("iit_fees.csv")

In [31]:
df.head()

,IIT,Gen/OBC/EWS (>₹5L),Gen/OBC/EWS (₹1–5L),Gen/OBC/EWS (<₹1L),SC/ST/PwD,Notes
0,IIT Bhubaneswar,"₹1,00,000 + ₹12,000","₹33,333 + ₹12,000","₹0 + ₹12,000","₹0 + ₹12,000","Hostel, mess extra"
1,IIT Bombay,"₹1,00,000 + ₹18,250","₹33,333 + ₹18,250","₹0 + ₹18,250","₹0 + ₹18,250","Hostel, mess extra"
2,IIT Delhi,"₹1,00,000 + ₹35,650","₹33,333 + ₹35,650","₹0 + ₹35,650","₹0 + ₹35,650","Hostel, mess extra"
3,IIT (BHU) Varanasi,"₹1,00,000 + ₹13,410","₹33,333 + ₹13,410","₹0 + ₹13,410","₹0 + ₹13,410","Hostel, mess extra"
4,IIT Dhanbad (ISM),"₹1,00,000 + ₹15,000","₹33,333 + ₹15,000","₹0 + ₹15,000","₹0 + ₹15,000","Hostel, mess extra"

In [ ]:
rank_df = pd.read_csv('NIRF_Engineering_Rankings_2024.csv')

In [35]:
rank_df.head()

,Institute_ID,Name,City,State,Score,Rank
0,IR-E-U-0456,Indian Institute of Technology Madras,Chennai,Tamil Nadu,89.46,1
1,IR-E-I-1074,Indian Institute of Technology Delhi,New Delhi,Delhi,86.66,2
2,IR-E-U-0306,Indian Institute of Technology Bombay,Mumbai,Maharashtra,83.09,3
3,IR-E-I-1075,Indian Institute of Technology Kanpur,Kanpur,Uttar Pradesh,82.79,4
4,IR-E-U-0573,Indian Institute of Technology Kharagpur,Kharagpur,West Bengal,76.88,5

In [36]:
rank_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Institute_ID  100 non-null    object
 1   Name          200 non-null    object
 2   City          200 non-null    object
 3   State         200 non-null    object
 4   Score         100 non-null    float64
 5   Rank          200 non-null    int64
dtypes: float64(1), int64(1), object(4)
memory usage: 9.5+ KB

In [37]:
rank_dff = rank_df.drop(['Institute_ID','Score'], axis=1)

In [38]:
rank_dff.head()

                                       Name       City          State  Rank
0     Indian Institute of Technology Madras    Chennai     Tamil Nadu     1
1      Indian Institute of Technology Delhi  New Delhi          Delhi     2
2     Indian Institute of Technology Bombay     Mumbai    Maharashtra     3
3     Indian Institute of Technology Kanpur     Kanpur  Uttar Pradesh     4
4  Indian Institute of Technology Kharagpur  Kharagpur    West Bengal     5

In [39]:
rank_dff.to_csv('rank_data.csv', index=False)

In [40]:
df = pd.read_csv('of.csv')

In [41]:
df.head()

,Institute,Branch,Placement Rate (%),Average Package (LPA),Median Package (LPA),Highest Package (LPA)
0,IIT Bombay,Computer Science & Engineering,95.9,52.8,NaN,210.0
1,IIT Bombay,Electrical Engineering,85.3,27.6,NaN,180.0
2,IIT Bombay,Mechanical Engineering,74.6,19.7,NaN,NaN
3,IIT Bombay,Chemical Engineering,74.4,15.6,NaN,NaN
4,IIT Bombay,Civil Engineering,73.5,14.2,NaN,NaN

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187 entries, 0 to 186
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Institute              187 non-null    object
 1   Branch                 187 non-null    object
 2   Placement Rate (%)     141 non-null    float64
 3   Average Package (LPA)  149 non-null    float64
 4   Median Package (LPA)   30 non-null     float64
 5   Highest Package (LPA)  60 non-null     float64
dtypes: float64(4), object(2)
memory usage: 8.9+ KB

In [4]:
cf = pd.read_csv("cutoff_data.csv")
ff = pd.read_csv("fees_data.csv")
rf = pd.read_csv("rank_data.csv")

In [50]:
cf.head()

,Institute,Academic Program,Seat Type,Gender,Opening Rank,Closing Rank,round_number
0,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Gender-Neutral,10063,13957,1
1,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Female-only (including Supernumerary),19820,22403,1
2,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Gender-Neutral,1912,2069,1
3,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Female-only (including Supernumerary),3450,3646,1
4,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,Gender-Neutral,4402,4996,1

In [100]:
ff = ff.rename(columns={"IIT": "Institute"})

In [59]:
ff["Institute"].unique()

array(['IIT Bhubaneswar', 'IIT Bombay', 'IIT Delhi', 'IIT (BHU) Varanasi',
       'IIT Dhanbad (ISM)', 'IIT Indore', 'IIT Gandhinagar',
       'IIT Guwahati', 'IIT Hyderabad', 'IIT Jodhpur', 'IIT Kanpur',
       'IIT Kharagpur', 'IIT Madras', 'IIT Mandi', 'IIT Palakkad',
       'IIT Patna', 'IIT Roorkee', 'IIT Ropar', 'IIT Tirupati',
       'IIT Bhilai', 'IIT Goa', 'IIT Jammu', 'IIT Dharwad'], dtype=object)

In [36]:
rf.head()

                                       Name       City          State  Rank
0     Indian Institute of Technology Madras    Chennai     Tamil Nadu     1
1      Indian Institute of Technology Delhi  New Delhi          Delhi     2
2     Indian Institute of Technology Bombay     Mumbai    Maharashtra     3
3     Indian Institute of Technology Kanpur     Kanpur  Uttar Pradesh     4
4  Indian Institute of Technology Kharagpur  Kharagpur    West Bengal     5

In [39]:
rf = rf.rename(columns={'Name': "Institute"})

In [40]:
rf.head()

                                  Institute       City          State  Rank
0     Indian Institute of Technology Madras    Chennai     Tamil Nadu     1
1      Indian Institute of Technology Delhi  New Delhi          Delhi     2
2     Indian Institute of Technology Bombay     Mumbai    Maharashtra     3
3     Indian Institute of Technology Kanpur     Kanpur  Uttar Pradesh     4
4  Indian Institute of Technology Kharagpur  Kharagpur    West Bengal     5

In [65]:
#cf['Institute'] = cf['Institute'].str.replace("Indian Institute of Technology", "IIT", regex=False)

cf['Institute'].unique()

array(['IIT Bhubaneswar', 'IIT Bombay', 'IIT Mandi', 'IIT Delhi',
       'IIT Indore', 'IIT Kharagpur', 'IIT Hyderabad', 'IIT Jodhpur',
       'IIT Kanpur', 'IIT Madras', 'IIT Gandhinagar', 'IIT Patna',
       'IIT Roorkee', 'IIT Dhanbad (ISM)', 'IIT Ropar',
       'IIT (BHU) Varanasi', 'IIT Guwahati', 'IIT Bhilai', 'IIT Goa',
       'IIT Palakkad', 'IIT Tirupati', 'IIT Jammu', 'IIT Dharwad'],
      dtype=object)

In [57]:
#rf['Institute'] = rf['Institute'].str.replace("Indian Institute of Technology", "IIT", regex=False)
rf['Institute'].unique()

array(['IIT Madras', 'IIT Delhi', 'IIT Bombay', 'IIT Kanpur',
       'IIT Kharagpur', 'IIT Roorkee', 'IIT Guwahati', 'IIT Hyderabad',
       'National Institute of Technology Tiruchirappalli',
       'IIT (BHU) Varanasi', 'Vellore Institute of Technology',
       'Jadavpur University',
       'S.R.M. Institute of Science and Technology', 'Anna University',
       'IIT Dhanbad (ISM)', 'IIT Indore',
       'National Institute of Technology Karnataka Surathkal',
       'IIT Gandhinagar', 'National Institute of Technology Rourkela',
       'Birla Institute of Technology and Science Pilani',
       'National Institute of Technology Warangal', 'IIT Ropar',
       'Amrita Vishwa Vidyapeetham', 'Jamia Millia Islamia',
       'National Institute of Technology Calicut', 'Siksha O Anusandhan',
       'Delhi Technological University', 'IIT Jodhpur',
       'Thapar Institute of Engineering and Technology (Deemed-to-be-university)',
       'Amity University', 'IIT Mandi', 'Chandigarh University',
       'Aligarh Muslim University', 'IIT Patna',
       'Koneru Lakshmaiah Education Foundation University (K L College of Engineering)',
       'Kalasalingam Academy of Research and Education',
       'Kalinga Institute of Industrial Technology',
       'Shanmugha Arts Science Technology and Research Academy',
       'Visvesvaraya National Institute of Technology Nagpur',
       'National Institute of Technology Silchar',
       'Institute of Chemical Technology', 'UPES',
       'Malaviya National Institute of Technology',
       'National Institute of Technology Durgapur',
       'National Institute of Technology Delhi',
       'Sri Sivasubramaniya Nadar College of Engineering',
       'International Institute of Information Technology Hyderabad',
       'Birla Institute of Technology',
       'Indian Institute of Engineering Science and Technology Shibpur',
       'Lovely Professional University',
       'Indian Institute of Space Science and Technology',
       'Graphic Era University',
       'Saveetha Institute of Medical and Technical Sciences',
       'IIT Bhubaneswar', 'National Institute of Technology Patna',
       'Manipal Institute of Technology',
       'Netaji Subhas University of Technology (NSUT)',
       'Dr. B R Ambedkar National Institute of Technology Jalandhar',
       'Sardar Vallabhbhai National Institute of Technology',
       'Motilal Nehru National Institute of Technology', 'IIT Tirupati',
       'IIT Jammu', 'Defence Institute of Advanced Technology',
       'Manipal University Jaipur', 'IIT Palakkad',
       'Sathyabama Institute of Science and Technology',
       'PSG College of Technology',
       'National Institute of Technology Meghalaya',
       'Visvesvaraya Technological University', 'University of Hyderabad',
       'National Institute of Technology Raipur',
       'Maulana Azad National Institute of Technology', 'IIT Bhilai',
       'International Institute of Information Technology Bangalore',
       'M. S. Ramaiah Institute of Technology',
       'Sant Longowal Institute of Engineering and Technology',
       'COEP Technological University', 'Banasthali Vidyapith',
       'National Institute of Technology Srinagar',
       'Rajiv Gandhi Institute of Petroleum Technology',
       'National Institute of Technology Kurukshetra',
       'National Institute of Technology Agartala',
       'Sri Krishna College of Engineering and Technology',
       'Madan Mohan Malaviya University of Technology',
       'Indraprastha Institute of Information Technology',
       'Vel Tech Rangarajan Dr. Sagunthala R & D Institute of Science and Technology',
       'Indian Institute of Information Technology Allahabad',
       'Jawaharlal Nehru Technological University',
       'Guru Gobind Singh Indraprastha University',
       'AU College of Engineering (A)',
       "Vignan's Foundation for Science Technology and Research",
       'Shoolini University of Biotechnology and Management Sciences',
       'Christ University', 'Chitkara University',
       'Jain University Bangalore', 'C.V. Raman Global University Odisha',
       'National Institute of Technology Puducherry', 'SR University',
       'R.V. College of Engineering',
       'Siddaganga Institute of Technology',
       'Amity University Haryana Gurgaon',
       'Amity University Rajasthan Jaipur',
       'Atal Bihari Vajpayee Indian Institute of Information Technology and Management',
       'Chandigarh Engineering College-CGC Landran Mohali',
       'Chennai Institute of Technology',
       'Coimbatore Institute of Technology',
       'College of Engineering Trivandrum',
       'Dr. Vishwanath Karad MIT World Peace University',
       'Galgotias University',
       'Gandhi Institute of Technology and Management',
       'Goka Raju Ranga Raju Institute of Engineering & Technology',
       'Hindustan Institute of Technology and Science (HITS)',
       'Indian Institute of Information Technology Design & Manufacturing Kancheepuram',
       'IIT Dharwad', 'Jaypee Institute of Information Technology',
       'Karunya Institute of Technology and Sciences',
       'Kongu Engineering College',
       'KPR Institute of Engineering and Technology',
       'Mahindra University',
       'Manav Rachna International Institute of Research and Studies',
       'Maulana Abul Kalam Azad University of Technology',
       'Mepco Schlenk Engineering College',
       'National Institute of Food Technology Entrepreneurship and Management',
       'National Institute of Technology Arunachal Pradesh',
       'National Institute of Technology Goa',
       'National Institute of Technology Hamirpur',
       'National Institute of Technology Manipur',
       'National Institute of Technology Mizoram',
       'National Institute of Technology Uttarakhand',
       'National Institute of Technology Jamshedpur', 'Nirma University',
       'Nitte Meenakshi Institute of Technology',
       'Noida Institute of Engineering & Technology',
       'Pandit Deendayal Energy University',
       'Pandit Dwarka Prasad Mishra Indian Institute of Information Technology Design and Manufacturing (IIITDM) Jabalpur',
       'Panjab University', 'PES University',
       'PSG Institute of Technology and Applied Research',
       'Punjab Engineering College (Deemed to be University) Chandigarh',
       'Rajalakshmi Engineering College', 'Sharda University',
       'Sri Sairam Engineering College',
       "SVKM's Narsee Monjee Institute of Management Studies",
       'The Northcap University', 'Thiagarajar College of Engineering',
       'University College of Engineering',
       'Veermata Jijabai Technological Institute (VJTI Mumbai)',
       'Vels Institute of Science Technology and Advanced Studies (VISTAS)',
       'Annamalai University', 'Anurag University',
       'B. S. Abdur Rahman Crescent Institute of Science and Technology',
       'B.M.S. College of Engineering',
       "Bansilal Ramnath Agarwal Charitable Trust's Vishwakarama Institute of Technology",
       'Bharati Vidyapeeth Deemed University College of Engineering',
       'C M R Institute of Technology',
       'Chaitanya Bharathi Institute of Technology',
       'CVR College of Engineering', 'Dayalbagh Educational Institute',
       'Dr. D. Y. Patil Institute of Technology',
       'Easwari Engineering College',
       'G. H. Raisoni College of Engineering Nagpur',
       'G. L. A. University',
       'G.L.Bajaj Institute of Technology and Management',
       'Indian Institute of Information Technology Guwahati',
       'Indira Gandhi Delhi Technical University for Women',
       'Institute of Aeronautical Engineering',
       'Institute of Engineering & Management',
       'J. C. Bose University of Science and Technology YMCA',
       "JSPM's Rajarshi Shahu College of Engineering",
       'KIET Group of Institutions: KIET Group of Pharmacy',
       'KLE Technological University', 'Kumaraguru College of Technology',
       'Maharishi Markandeshwar (Deemed to be University)',
       'Maulana Azad National Urdu University',
       'National Engineering College',
       'National Institute of Advanced Manufacturing Technology Ranchi',
       'National Institute of Technology Nagaland',
       'National Institute of Technology Sikkim',
       'New Horizon College of Engineering',
       'NMAM Institute of Technology',
       'North Eastern Regional Institute of Science & Technology',
       'R.M.K. Engineering College',
       'Rajalakshmi Institute of Technology',
       'Shri Mata Vaishno Devi University', 'Sona College of Technology',
       'Sri Krishna College of Technology',
       'Sri Ramakrishna Engineering College',
       'Sri Venkateswara College of Engineering', 'Tezpur University',
       'The National Institute of Engineering',
       'Vallurupalli Nageswara Rao Vignana Jyothi Institute of Engineering and Technology',
       'Vardhaman College of Engineering',
       'Veer Surendra Sai University of Technology',
       'Velagapudi Ramakrishna Siddhartha Engineering College',
       'Vignan Institute of Technology and Science',
       'Yeshwantrao Chavan College of Engineering'], dtype=object)

In [56]:
#ff['Institute'] = ff['Institute'].str.replace("Indian Institute of Technology", "IIT", regex=False)

ff['Institute'].unique()

array(['IIT Bhubaneswar', 'IIT Bombay', 'IIT Delhi', 'IIT (BHU) Varanasi',
       'IIT Dhanbad (ISM)', 'IIT Indore', 'IIT Gandhinagar',
       'IIT Guwahati', 'IIT Hyderabad', 'IIT Jodhpur', 'IIT Kanpur',
       'IIT Kharagpur', 'IIT Madras', 'IIT Mandi', 'IIT Palakkad',
       'IIT Patna', 'IIT Roorkee', 'IIT Ropar', 'IIT Tirupati',
       'IIT Bhilai', 'IIT Goa', 'IIT Jammu', 'IIT Dharwad'], dtype=object)

In [51]:
ff.head()

,Institute,Gen/OBC/EWS (>₹5L),Gen/OBC/EWS (₹1–5L),Gen/OBC/EWS (<₹1L),SC/ST/PwD,Notes
0,IIT Bhubaneswar,"₹1,00,000 + ₹12,000","₹33,333 + ₹12,000","₹0 + ₹12,000","₹0 + ₹12,000","Hostel, mess extra"
1,IIT Bombay,"₹1,00,000 + ₹18,250","₹33,333 + ₹18,250","₹0 + ₹18,250","₹0 + ₹18,250","Hostel, mess extra"
2,IIT Delhi,"₹1,00,000 + ₹35,650","₹33,333 + ₹35,650","₹0 + ₹35,650","₹0 + ₹35,650","Hostel, mess extra"
3,IIT (BHU) Varanasi,"₹1,00,000 + ₹13,410","₹33,333 + ₹13,410","₹0 + ₹13,410","₹0 + ₹13,410","Hostel, mess extra"
4,IIT Dhanbad (ISM),"₹1,00,000 + ₹15,000","₹33,333 + ₹15,000","₹0 + ₹15,000","₹0 + ₹15,000","Hostel, mess extra"

In [62]:
name_map = {
    "IIT (Banaras Hindu University) Varanasi": "IIT (BHU) Varanasi",
    "IIT (Indian School of Mines) Dhanbad": "IIT Dhanbad (ISM)",
    "IIT BHU Varanasi": "IIT (BHU) Varanasi",
    "ISM Dhanbad": "IIT Dhanbad (ISM)",
    "IIT Dhanbad": "IIT Dhanbad (ISM)",
    "IIT Dharwad": "IIT Dharwad",
    "IIT (ISM) Dhanbad": "IIT Dhanbad (ISM)", # already fine
}

In [63]:
rf['Institute'] = rf['Institute'].replace(name_map)
cf['Institute'] = cf['Institute'].replace(name_map)
ff['Institute'] = ff['Institute'].replace(name_map)

In [103]:
cf.to_csv('cutoff_data.csv', index=False)
ff.to_csv('fees_data.csv', index=False)
rf.to_csv('rank_data.csv', index=False)

,Institute,Academic Program,Seat Type,Gender,Opening Rank,Closing Rank,round_number
0,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Gender-Neutral,10063,13957,1
1,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Female-only (including Supernumerary),19820,22403,1
2,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Gender-Neutral,1912,2069,1
3,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Female-only (including Supernumerary),3450,3646,1
4,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,Gender-Neutral,4402,4996,1

In [66]:
cf.head()

,Institute,Academic Program,Seat Type,Gender,Opening Rank,Closing Rank,round_number
0,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Gender-Neutral,10063,13957,1
1,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Female-only (including Supernumerary),19820,22403,1
2,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Gender-Neutral,1912,2069,1
3,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Female-only (including Supernumerary),3450,3646,1
4,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,Gender-Neutral,4402,4996,1

In [68]:
ff.head()

,Institute,Gen/OBC/EWS (>₹5L),Gen/OBC/EWS (₹1–5L),Gen/OBC/EWS (<₹1L),SC/ST/PwD,Notes
0,IIT Bhubaneswar,"₹1,00,000 + ₹12,000","₹33,333 + ₹12,000","₹0 + ₹12,000","₹0 + ₹12,000","Hostel, mess extra"
1,IIT Bombay,"₹1,00,000 + ₹18,250","₹33,333 + ₹18,250","₹0 + ₹18,250","₹0 + ₹18,250","Hostel, mess extra"
2,IIT Delhi,"₹1,00,000 + ₹35,650","₹33,333 + ₹35,650","₹0 + ₹35,650","₹0 + ₹35,650","Hostel, mess extra"
3,IIT (BHU) Varanasi,"₹1,00,000 + ₹13,410","₹33,333 + ₹13,410","₹0 + ₹13,410","₹0 + ₹13,410","Hostel, mess extra"
4,IIT Dhanbad (ISM),"₹1,00,000 + ₹15,000","₹33,333 + ₹15,000","₹0 + ₹15,000","₹0 + ₹15,000","Hostel, mess extra"

In [69]:
rf.head()

       Institute       City          State  Rank
0     IIT Madras    Chennai     Tamil Nadu     1
1      IIT Delhi  New Delhi          Delhi     2
2     IIT Bombay     Mumbai    Maharashtra     3
3     IIT Kanpur     Kanpur  Uttar Pradesh     4
4  IIT Kharagpur  Kharagpur    West Bengal     5

In [70]:
# Combine institute names from all datasets
all_institutes = pd.concat([
    cf['Institute'],
    ff['Institute'],
    rf['Institute']
])

# Remove duplicates and standardize names if needed
unique_institutes = all_institutes.drop_duplicates().reset_index(drop=True)

# Create college_id
college_table = pd.DataFrame({
    'college_id': range(1, len(unique_institutes) + 1),
    'Institute': unique_institutes
})

In [72]:
college_table

     college_id                                          Institute
0             1                                    IIT Bhubaneswar
1             2                                         IIT Bombay
2             3                                          IIT Mandi
3             4                                          IIT Delhi
4             5                                         IIT Indore
..          ...                                                ...
192         193                   Vardhaman College of Engineering
193         194         Veer Surendra Sai University of Technology
194         195  Velagapudi Ramakrishna Siddhartha Engineering ...
195         196         Vignan Institute of Technology and Science
196         197          Yeshwantrao Chavan College of Engineering

[197 rows x 2 columns]

In [73]:
cf = cf.merge(college_table, on='Institute', how='left')

In [75]:
cf['college_id'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23], dtype=int64)

In [76]:
ff = ff.merge(college_table, on='Institute', how='left')

In [77]:
rf = rf.merge(college_table, on='Institute', how='left')

In [78]:
rf.head()

       Institute       City          State  Rank  college_id
0     IIT Madras    Chennai     Tamil Nadu     1          10
1      IIT Delhi  New Delhi          Delhi     2           4
2     IIT Bombay     Mumbai    Maharashtra     3           2
3     IIT Kanpur     Kanpur  Uttar Pradesh     4           9
4  IIT Kharagpur  Kharagpur    West Bengal     5           6

In [88]:
# Sort rank_data by Rank (just to be sure)
rf = rf.sort_values(by='Rank').reset_index(drop=True)

# Assign college_id based on Rank
rf['college_id'] = rf['Rank']  # or just use range if needed

In [110]:
rf = rf.rename(columns={
    "Institute": "institute",
    "City": "city",
    "State": "state",
    "Rank": "rank"
    # "college_id" is already correct
})

In [111]:
rf.head()

       institute       city          state  rank  college_id
0     IIT Madras    Chennai     Tamil Nadu     1           1
1      IIT Delhi  New Delhi          Delhi     2           2
2     IIT Bombay     Mumbai    Maharashtra     3           3
3     IIT Kanpur     Kanpur  Uttar Pradesh     4           4
4  IIT Kharagpur  Kharagpur    West Bengal     5           5

In [90]:
cf = cf.merge(rf[['Institute', 'college_id']], on='Institute', how='left')

In [101]:
ff = ff.merge(rf[['Institute', 'college_id']], on='Institute', how='left')

In [108]:
cf = cf.rename(columns={
    "Institute": "institute",
    "Academic Program": "academic_program",
    "Seat Type": "seat_type",
    "Gender": "gender",
    "Opening Rank": "opening_rank",
    "Closing Rank": "closing_rank"
})

In [5]:
cf

,Institute,Academic Program,Seat Type,Gender,Opening Rank,Closing Rank,round_number,college_id
0,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Gender-Neutral,10063,13957,1,54.0
1,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,Female-only (including Supernumerary),19820,22403,1,54.0
2,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Gender-Neutral,1912,2069,1,54.0
3,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",EWS,Female-only (including Supernumerary),3450,3646,1,54.0
4,IIT Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,Gender-Neutral,4402,4996,1,54.0
...,...,...,...,...,...,...,...,...
15617,IIT Dharwad,"Mechanical Engineering (4 Years, Bachelor of T...",OBC-NCL,Female-only (including Supernumerary),8099,8761,5,115.0
15618,IIT Dharwad,"Mechanical Engineering (4 Years, Bachelor of T...",SC,Gender-Neutral,2441,2789,5,115.0
15619,IIT Dharwad,"Mechanical Engineering (4 Years, Bachelor of T...",SC,Female-only (including Supernumerary),3390,3508,5,115.0
15620,IIT Dharwad,"Mechanical Engineering (4 Years, Bachelor of T...",ST,Gender-Neutral,1169,1213,5,115.0
15621,IIT Dharwad,"Mechanical Engineering (4 Years, Bachelor of T...",ST,Female-only (including Supernumerary),1725,1725,5,115.0

In [107]:

ff.head()

,institute,gen_obc_ews_gt_5l,gen_obc_ews_1to5l,gen_obc_ews_lt_1l,sc_st_pwd,notes,college_id
0,IIT Bhubaneswar,"₹1,00,000 + ₹12,000","₹33,333 + ₹12,000","₹0 + ₹12,000","₹0 + ₹12,000","Hostel, mess extra",54.0
1,IIT Bombay,"₹1,00,000 + ₹18,250","₹33,333 + ₹18,250","₹0 + ₹18,250","₹0 + ₹18,250","Hostel, mess extra",3.0
2,IIT Delhi,"₹1,00,000 + ₹35,650","₹33,333 + ₹35,650","₹0 + ₹35,650","₹0 + ₹35,650","Hostel, mess extra",2.0
3,IIT (BHU) Varanasi,"₹1,00,000 + ₹13,410","₹33,333 + ₹13,410","₹0 + ₹13,410","₹0 + ₹13,410","Hostel, mess extra",10.0
4,IIT Dhanbad (ISM),"₹1,00,000 + ₹15,000","₹33,333 + ₹15,000","₹0 + ₹15,000","₹0 + ₹15,000","Hostel, mess extra",15.0

In [106]:
ff = ff.rename(columns={
    "Institute": "institute",
    "Gen/OBC/EWS (>₹5L)": "gen_obc_ews_gt_5l",
    "Gen/OBC/EWS (₹1–5L)": "gen_obc_ews_1to5l",
    "Gen/OBC/EWS (<₹1L)": "gen_obc_ews_lt_1l",
    "SC/ST/PwD": "sc_st_pwd",
    "Notes": "notes"
})

## Cleaning cutoff data

In [1]:
import pandas as pd
import numpy as np

In [15]:
cf = pd.read_csv("cutoff_data.csv")

In [5]:
cf.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,nirf_rank,program_name,duration,degree_raw
0,IIT Bhubaneswar,OPEN,Gender-Neutral,10063,13957,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
1,IIT Bhubaneswar,OPEN,Female-only (including Supernumerary),19820,22403,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
2,IIT Bhubaneswar,EWS,Gender-Neutral,1912,2069,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
3,IIT Bhubaneswar,EWS,Female-only (including Supernumerary),3450,3646,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
4,IIT Bhubaneswar,OBC-NCL,Gender-Neutral,4402,4996,1,54.0,Civil Engineering,4 Years,Bachelor of Technology

In [52]:
cf["gender"].unique()

array(['Gender-Neutral', 'Female-only (including Supernumerary)'],
      dtype=object)

In [8]:
cf['program_name'] = cf['academic_program'].str.extract(r'^(.*?)(?:\s*\(.*\))')

In [25]:
cf["program_name"].unique()

array(['Civil Engineering', 'Computer Science and Engineering',
       'Electrical Engineering',
       'Electronics and Communication Engineering', 'Engineering Physics',
       'Mathematics and Computing', 'Mechanical Engineering',
       'Metallurgical and Materials Engineering', 'Aerospace Engineering',
       'Applied Geophysics', 'Mathematics', 'Chemical Engineering',
       'Chemistry', 'Economics', 'Energy Engineering',
       'Environmental Science and Engineering',
       'Industrial Engineering and Operations Research',
       'Metallurgical Engineering and Materials Science',
       'General Engineering', 'Materials Science and Engineering',
       'Microelectronics & VLSI', 'Bio Engineering', 'Chemical Sciences',
       'Data Science and Artificial Intelligence',
       'Abu Dhabi Campus - Chemical Engineering',
       'Abu Dhabi Campus - Computer Science and Engineering',
       'Abu Dhabi Campus - Energy Engineering',
       'Biotechnology and Biochemical Engineering', 'Design',
       'Engineering and Computational Mechanics', 'Materials Engineering',
       'Production and Industrial Engineering', 'Textile Technology',
       'Space Science and Engineering',
       'Agricultural and Food Engineering', 'Applied Geology',
       'Architecture', 'Artificial Intelligence',
       'Electronics and Electrical Communication Engineering',
       'Exploration Geophysics', 'Industrial and Systems Engineering',
       'Instrumentation Engineering',
       'Manufacturing Science and Engineering', 'Mining Engineering',
       'Ocean Engineering and Naval Architecture', 'Physics',
       'Biomedical Engineering', 'Biotechnology and Bioinformatics',
       'Computational Engineering', 'Engineering Science',
       'Industrial Chemistry',
       'Materials Science and Metallurgical Engineering',
       'Artificial Intelligence and Data Science',
       'Chemistry with Specialization',
       'Civil and Infrastructure Engineering', 'Electronics Engineering',
       'Physics with Specialization',
       'Biological Sciences and Bioengineering', 'Earth Sciences',
       'Mathematics and Scientific Computing',
       'Statistics and Data Science',
       'Artificial Intelligence and Data Analytics',
       'Biological Engineering', 'Biological Science',
       'Computational Engineering and Mechanics', 'Engineering Design',
       'Instrumentation and Biomedical Engineering',
       'Naval Architecture and Ocean Engineering',
       'Integrated Circuit Design & Technology',
       'B. Tech in CE. - M. Tech. in Geotechnical Engineering',
       'B. Tech in CE. - M. Tech. in Structural Engineering', 'B. Tech.',
       'B.Tech',
       'B.Tech. in Electronics and Communication Engineering and M.Tech. in Communication Systems',
       'Economics with MBA', 'Chemical Science and Technology',
       'Electrical and Electronics Engineering',
       'Biosciences and Bioengineering', 'Geological Technology',
       'Geophysical Technology', 'Mathematics & Computing',
       'B.Tech Mining Engineering and MBA in Logistic and Supply Chain Management',
       'Chemical Science', 'Environmental Engineering',
       'Mineral and Metallurgical Engineering',
       'Mining Machinery Engineering', 'Petroleum Engineering',
       'Physical Science', 'Artificial Intelligence and Data Engineering',
       'Digital Agriculture', 'Biochemical Engineering', 'Bioengineering',
       'Ceramic Engineering', 'Materials Science and Technology',
       'Metallurgical Engineering',
       'Pharmaceutical Engineering & Technology',
       'Electronics and Electrical Engineering',
       'Mechatronics Engineering', 'Data Science and Engineering',
       'Chemical and Biochemical Engineering',
       'Interdisciplinary Sciences'], dtype=object)

In [11]:
cf['duration'] = cf['academic_program'].str.extract(r'\((\d+ Years)')

In [ ]:
cf['duration'].unique()

array(['4 Years', '5 Years'], dtype=object)

In [14]:
cf['degree_raw'] = cf['academic_program'].str.extract(r'\,\s*(.*?)\)$')

In [17]:
cf['degree_raw'].unique()

array(['Bachelor of Technology', 'Bachelor of Science',
       'Bachelor and Master of Technology (Dual Degree)',
       'Bachelor of Architecture', 'B.Tech. + M.Tech./MS (Dual Degree)',
       'Bachelor of Technology and MBA (Dual Degree)',
       'Bachelor of Science and MBA (Dual Degree)',
       'Bachelor of Science and Master of Science (Dual Degree)',
       'Integrated Master of Technology', 'Integrated B. Tech. and MBA',
       'Integrated Bachelor of Science-Master of Science'], dtype=object)

In [46]:
cf = cf.rename(columns={"college_id":"nirf_rank"})

In [18]:
cf['program_name_2'] = cf['academic_program'].str.extract(r'^(.*?)(?:\s*\(\d+ Years, .*?\))')[0].str.strip()

In [17]:
cf['opening_rank'] = pd.to_numeric(cf['opening_rank'], errors='coerce')  # invalid values become NaN

# Optional: You can also do the same for 'closing_rank' if needed
cf['closing_rank'] = pd.to_numeric(cf['closing_rank'], errors='coerce')

In [50]:
cf.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,nirf_rank,program_name,duration,degree_raw
0,IIT Bhubaneswar,OPEN,Gender-Neutral,10063,13957,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
1,IIT Bhubaneswar,OPEN,Female-only (including Supernumerary),19820,22403,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
2,IIT Bhubaneswar,EWS,Gender-Neutral,1912,2069,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
3,IIT Bhubaneswar,EWS,Female-only (including Supernumerary),3450,3646,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
4,IIT Bhubaneswar,OBC-NCL,Gender-Neutral,4402,4996,1,54.0,Civil Engineering,4 Years,Bachelor of Technology

In [24]:
cf['program_name'] = cf['program_name'].str.replace(r'^(B\.?Tech in |BS in )', '', regex=True)

In [4]:
cf.drop(columns=["academic_program","program_name_2"], inplace=True)

In [38]:
print(cf.isnull().sum())

institute             0
academic_program      0
seat_type             0
gender                0
opening_rank          0
closing_rank          0
round_number          0
college_id          195
program_name          0
duration              0
degree_raw            0
program_name_2        0
dtype: int64

In [18]:
cf.to_csv('cutoff_data.csv', index=False)

## Cleaning Fees data

In [28]:
ff = pd.read_csv("fees_data.csv")

In [29]:
ff.head()

,institute,gen_obc_ews_gt_5l,gen_obc_ews_1to5l,gen_obc_ews_lt_1l,sc_st_pwd,notes,college_id
0,IIT Bhubaneswar,"₹1,00,000 + ₹12,000","₹33,333 + ₹12,000","₹0 + ₹12,000","₹0 + ₹12,000","Hostel, mess extra",54.0
1,IIT Bombay,"₹1,00,000 + ₹18,250","₹33,333 + ₹18,250","₹0 + ₹18,250","₹0 + ₹18,250","Hostel, mess extra",3.0
2,IIT Delhi,"₹1,00,000 + ₹35,650","₹33,333 + ₹35,650","₹0 + ₹35,650","₹0 + ₹35,650","Hostel, mess extra",2.0
3,IIT (BHU) Varanasi,"₹1,00,000 + ₹13,410","₹33,333 + ₹13,410","₹0 + ₹13,410","₹0 + ₹13,410","Hostel, mess extra",10.0
4,IIT Dhanbad (ISM),"₹1,00,000 + ₹15,000","₹33,333 + ₹15,000","₹0 + ₹15,000","₹0 + ₹15,000","Hostel, mess extra",15.0

In [33]:
ff["notes"]

0     Hostel, mess extra
1     Hostel, mess extra
2     Hostel, mess extra
3     Hostel, mess extra
4     Hostel, mess extra
5     Hostel, mess extra
6     Hostel, mess extra
7     Hostel, mess extra
8     Hostel, mess extra
9     Hostel, mess extra
10    Hostel, mess extra
11    Hostel, mess extra
12    Hostel, mess extra
13    Hostel, mess extra
14    Hostel, mess extra
15    Hostel, mess extra
16    Hostel, mess extra
17    Hostel, mess extra
18    Hostel, mess extra
19    Hostel, mess extra
20    Hostel, mess extra
21    Hostel, mess extra
22    Hostel, mess extra
Name: notes, dtype: object

## Cleaning Rank Data

In [35]:
rf = pd.read_csv("rank_data.csv")

In [36]:
rf.head()

       institute       city          state  rank  college_id
0     IIT Madras    Chennai     Tamil Nadu     1           1
1      IIT Delhi  New Delhi          Delhi     2           2
2     IIT Bombay     Mumbai    Maharashtra     3           3
3     IIT Kanpur     Kanpur  Uttar Pradesh     4           4
4  IIT Kharagpur  Kharagpur    West Bengal     5           5

In [37]:
rf["institute"]

0                                             IIT Madras
1                                              IIT Delhi
2                                             IIT Bombay
3                                             IIT Kanpur
4                                          IIT Kharagpur
                             ...
195                     Vardhaman College of Engineering
196           Veer Surendra Sai University of Technology
197    Velagapudi Ramakrishna Siddhartha Engineering ...
198           Vignan Institute of Technology and Science
199            Yeshwantrao Chavan College of Engineering
Name: institute, Length: 200, dtype: object

In [40]:
print(ff.isnull().sum())

institute            0
gen_obc_ews_gt_5l    0
gen_obc_ews_1to5l    0
gen_obc_ews_lt_1l    0
sc_st_pwd            0
notes                0
college_id           1
dtype: int64

In [1]:
import pandas as pd

In [2]:
iit = pd.read_csv("cutoff_data_2.csv")

In [3]:
iit.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,nirf_rank,program_name,duration,degree_raw
0,IIT Bhubaneswar,OPEN,Gender-Neutral,10063.0,13957.0,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
1,IIT Bhubaneswar,OPEN,Female-only (including Supernumerary),19820.0,22403.0,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
2,IIT Bhubaneswar,EWS,Gender-Neutral,1912.0,2069.0,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
3,IIT Bhubaneswar,EWS,Female-only (including Supernumerary),3450.0,3646.0,1,54.0,Civil Engineering,4 Years,Bachelor of Technology
4,IIT Bhubaneswar,OBC-NCL,Gender-Neutral,4402.0,4996.0,1,54.0,Civil Engineering,4 Years,Bachelor of Technology

In [4]:
iit["institute"].unique()

array(['IIT Bhubaneswar', 'IIT Bombay', 'IIT Mandi', 'IIT Delhi',
       'IIT Indore', 'IIT Kharagpur', 'IIT Hyderabad', 'IIT Jodhpur',
       'IIT Kanpur', 'IIT Madras', 'IIT Gandhinagar', 'IIT Patna',
       'IIT Roorkee', 'IIT Dhanbad (ISM)', 'IIT Ropar',
       'IIT (BHU) Varanasi', 'IIT Guwahati', 'IIT Bhilai', 'IIT Goa',
       'IIT Palakkad', 'IIT Tirupati', 'IIT Jammu', 'IIT Dharwad'],
      dtype=object)

In [5]:
iit_placement_data = {
    'institute': [
        'IIT Bhubaneswar', 'IIT Bombay', 'IIT Mandi', 'IIT Delhi',
        'IIT Indore', 'IIT Kharagpur', 'IIT Hyderabad', 'IIT Jodhpur',
        'IIT Kanpur', 'IIT Madras', 'IIT Gandhinagar', 'IIT Patna',
        'IIT Roorkee', 'IIT Dhanbad (ISM)', 'IIT Ropar',
        'IIT (BHU) Varanasi', 'IIT Guwahati', 'IIT Bhilai', 'IIT Goa',
        'IIT Palakkad', 'IIT Tirupati', 'IIT Jammu', 'IIT Dharwad'
    ],
    'average_package': [
        17.16, 23.50, 12.00, 17.60,
        25.45, 24.00, 23.26, 26.31,
        26.27, 17.00, 19.60, 17.00,
        18.30, 13.13, 22.27,
        22.80, 25.75, 14.00, 16.32,
        13.95, 18.39, 17.60, 18.00
    ],
    'highest_package': [
        56.00, 367.00, 25.00, 205.00,
        100.00, 260.00, 110.00, 53.00,
        550.00, 131.00, 60.00, 82.05,
        205.00, 60.00, 55.00,
        220.00, 205.00, 48.64, 51.00,
        46.15, 41.60, 53.00, 52.00
    ]
}

iit_placement_df = pd.DataFrame(iit_placement_data)

In [6]:
iit = iit.merge(iit_placement_df, on='institute', how='left')

In [7]:
iit.isna().sum()

institute            0
seat_type            0
gender               0
opening_rank       598
closing_rank       646
round_number         0
nirf_rank          195
program_name         0
duration             0
degree_raw           0
average_package      0
highest_package      0
dtype: int64

In [8]:
iit.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,nirf_rank,program_name,duration,degree_raw,average_package,highest_package
0,IIT Bhubaneswar,OPEN,Gender-Neutral,10063.0,13957.0,1,54.0,Civil Engineering,4 Years,Bachelor of Technology,17.16,56.0
1,IIT Bhubaneswar,OPEN,Female-only (including Supernumerary),19820.0,22403.0,1,54.0,Civil Engineering,4 Years,Bachelor of Technology,17.16,56.0
2,IIT Bhubaneswar,EWS,Gender-Neutral,1912.0,2069.0,1,54.0,Civil Engineering,4 Years,Bachelor of Technology,17.16,56.0
3,IIT Bhubaneswar,EWS,Female-only (including Supernumerary),3450.0,3646.0,1,54.0,Civil Engineering,4 Years,Bachelor of Technology,17.16,56.0
4,IIT Bhubaneswar,OBC-NCL,Gender-Neutral,4402.0,4996.0,1,54.0,Civil Engineering,4 Years,Bachelor of Technology,17.16,56.0

In [9]:
iit = iit.rename(columns={"degree_raw":"degree"})

In [11]:
iit.to_csv("iit_data.csv", index=False)